# Definitions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionGroup..::..Definitions Property
DefinitionGroup Class See Also
---
The Definitions property returns an object that contains all the shared parameter definitions within the group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Definitions Definitions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Definitions As Definitions
	Get
```

Visual C++
---
```text
public:
property Definitions^ Definitions {
	Definitions^ get ();
}
```

# Remarks
A known definition can be retrieved, by name, using the Item property on the Definitions object. A new definition can be created by using the Create method. The Create method takes two parameters, a string for name and a type. If the creation of the definition was successful then an object representing the definition is returned by the Create method.
# See Also
DefinitionGroup Class
Autodesk.Revit.DB Namespace